compositionalDarcyFoam/tests/BuckleyLeverett/heterogeneous/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  foam-extend 5.0
    \\  /    A nd           | PorousMedia: A Wikki Brasil project
     \\/     M anipulation  | Solver: coupledMatrixFoam
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
();

regions
(
    boxToCell
    {
        box (-1e20 0.0325 -1e20) (1e20 1e20 1e20);

        fieldValues
        (
            volScalarFieldValue alpha.rock 0.9
            volScalarFieldValue alpha.oil  0.1
        );
    }
);

// ************************************************************************* //
